cf/Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПриходныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Партии/Forms/ФормаЭлементаОткрыть/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Сообщить("Невозможно осздание партии! Создание Партии происходит только на основании документа поступления!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(Параметры.Отбор.ДатаОстатков) Тогда
			ДатаОстатков = КонецМесяца(ТекущаяДата());
		Иначе
			ДатаОстатков = Параметры.Отбор.ДатаОстатков;
		КонецЕсли;
		
		СтруктураОстатков   = Справочники.Партии.ПолучитьОстатокНаДату(Параметры.Отбор.Владелец,Параметры.Отбор.Организация,Параметры.Отбор.Склад,Параметры.Ключ,Параметры.Отбор.ДатаОстатков);
		ДатаОстатка 		= СтруктураОстатков.ДатаОстатка;

	Исключение         		
		ДатаОстатка 		= КонецМесяца(ТекущаяДата());
		СтруктураОстатков   = Справочники.Партии.ПолучитьОстатокНаДату(Параметры.Ключ.Владелец,Неопределено,Неопределено,Параметры.Ключ,ДатаОстатка);
	КонецПопытки; 	
	
	ОстатокНаКонецВсегоПериода = СтруктураОстатков.ОстатокНаКонецВсегоПериода;
	СуммаОстаткаВРубНаКонецВсегоПериода =  ОстатокНаКонецВсегоПериода * Объект.ЗакупочнаяЦена;
	ДатаОстаткаНаКонецвсегоПериода = КонецМесяца(ТекущаяДата());
	
	Остаток 			= СтруктураОстатков.Остаток;
	СуммаОстаткаВРуб 	= Остаток * Объект.ЗакупочнаяЦена;
	
	Если ЗначениеЗаполнено(Объект.ПриходныйДокумент) Тогда
		Поставщик 			= Объект.ПриходныйДокумент.Контрагент;
		ДоговорПоставщика 	= Объект.ПриходныйДокумент.ДоговорСКонтрагентом;
	КонецЕсли;
	
	Элементы.ДатаОстатка.Заголовок 						= "" +СтруктураОстатков.ВидКонтроляОстатков;
	Элементы.ДатаОстаткаНаКонецВсегоПериода.Заголовок 	= "на конец всего периода";
	ЭтаФорма.Заголовок = "" + Объект.Код+ " " +"Карточка партии: " +Объект.Владелец;
	
КонецПроцедуры
